Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: གོས་འདོད་པ་རྣམས་ལ་གོས་དང་། མེ་ཏོག་འདོད་པ་རྣམས་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་འདོད་པ་རྣམས་ལ་ཕྲེང་བ་དང་། སྤོས་འདོད་པ་རྣམས་ལ་སྤོས་དང་། བདུག་པ་འདོད་པ་རྣམས་ལ་བདུག་པ་དང་། བྱུག་པ་འདོད་པ་རྣམས་ལ་བྱུག་པ་དང་། ཕྱེ་མ་འདོད་པ་རྣམས་ལ་ཕྱེ་མ་དང་། རྒྱན་དང་ལྷབ་ལྷུབ་འདོད་པ་རྣམས་ལ་རྒྱན་དང་ལྷབ་ལྷུབ་དང་། རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་རིན་པོ་ཆེ་དང་། གསེར་འདོད་པ་རྣམས་ལ་གསེར་དང་། དངུལ་འདོད་པ་རྣམས་ལ་དངུལ་དང་། མུ་ཏིག་འདོད་པ་རྣམས་ལ་མུ་ཏིག་དང་། རྟེན་འདོད་པ་རྣམས་ལ་རྟེན་དང་། སྟན་འདོད་པ་རྣམས་ལ་བསྟན་དང་། མལ་ཆ་འདོད་པ་རྣམས་ལ་མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་འདོད་པ་རྣམས་ལ་ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་དང་། བཞོན་པ་འདོད་པ་རྣམས་ལ་བཞོན་པ་དང་། དགའ་བ་འདོད་པ་རྣམས་ལ་དགའ་བ་དང་། གླང་པོ་དང་རྟ་དང་། ཤིང་རྟ་དང་། བ་ལང་དང་། བོང་བུ་དང་མ་ཧེ་དང་། ར་ལུག་འདོད་པ་རྣམས་ལ་གླང་པོ་དང་། རྟ་དང་ཤིང་རྟ་དང་བ་ལང་དང་། བོང་བུ་དང་མ་ཧེ་དང་། ར་ལུག་དང་། རྒྱལ་མཚན་དང་། གདུགས་དང་། བ་དན་འདོད་པ་རྣམས་ལ་རྒྱལ་མཚན་དང་། གདུགས་དང་བ་དན་དང་། བྲན་ཕོ་དང་བྲན་མོ་འདོད་པ་རྣམས་ལ་བྲན་ཕོ་དང་བྲན་མོ་དང་འཁོར་གྱི་བྱིས་པ་འདོད་པ་རྣམས་ལ་འཁོར་གྱི་བྱིས་པ་དང་། བུད་མེད་འདོད་པ་རྣམས་ལ་བུད་མྱེད་དང་། བུ་མོ་གཞོན་ནུ་འདོད་པ་རྣམས་ལ་བུ་མོ་གཞོན་ནུ་དང་། ཅོད་པན་དང་གཙུག་གི་རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་ཅོད་པན་དང་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཐོར་པག་དང་བཅས་པའི་གཙུག་གི་རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་ཐོར་པག་དང་བཅས་པའི་གཙུག་གི་རིན་པོ་ཆེ་དང་། སྐྲ་མཐོན་ཏིང་དྲི་མ་མྱེད་པའི་དཀྱིལ་འཁོར་འདོད་པ་རྣམས་ལ་སྐྲ་མཐོན་ཏིང་དྲི་མ་མྱེད་པའི་དཀྱིལ་འཁོར་གྱི་སྦྱིན་པ་བྱེད་པ་ནས། ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་འདོད་པ་རྣམས་ལ་ཡང་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་སྦྱིན་པ་བྱེད་དོ། །
en: Through its power I give food to those who wish for food; drink for those who wish for drink; excellent flavors to those who wish for excellent flavors; hard food to those who wish for hard food; soft food to those who wish for soft food; food that is licked to those who wish for food that is licked; food that is sucked to those who wish for food that is sucked; clothes to those who wish for clothes; flowers to those who wish for flowers; garlands to those who wish for garlands; perfume to those who wish for perfume; incense to those who wish for incense; ointments to those who wish for ointments; powders to those who wish for powders; jewelry and adornments to those who wish for jewelry and adornments; jewels to those who wish for jewels; gold to those who wish for gold; silver to those who wish for silver; pearls to those who wish for pearls; dwellings to those who wish for dwellings; seats to those who wish for seats; beds to those who wish for beds; medicine that heals illness to those who wish for medicine that heals illness; utensils to those who wish for utensils; carriages to those who wish for carriages; steeds to those who wish for steeds; elephants, horses, chariots, oxen, donkeys, water buffalo, sheep, and goats to those who wish for elephants, horses, chariots, oxen, donkeys, water buffalo, sheep, and goats; banners, parasols, and flags to those who wish for banners, parasols, and flags; male and female slaves to those who wish for male and female slaves; a retinue of youths to those who wish for a retinue of youths; women to those who wish for women; girls to those who wish for girls; crowns and topknot jewels to those who wish for crowns and topknot jewels; topknot jewels combined with leather to those who wish for topknot jewels combined with leather; locks of pure, deep-black hair to those who wish for locks of pure, deep-black hair; and so on, up to I give all the various kinds of utensils to those who wish for all the various kinds of utensils.

source: རིགས་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་དང་། དེའུ་རེ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ། དེ་སྐད་དུ་ཁྱིམ་བདག་མཁས་པས། ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་དེའི་མོད་ལ་སེམས་ཅན་གྲངས་མེད་པ་ཞིག་ཁྱིམ་བདག་མཁས་པའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས། ཕྱོགས་ཐ་དད་པ་དང་། ཡུལ་ཐ་དད་པ་དང་། གནས་ཐ་དད་པ་དང་། གྲོང་ཁྱེར་ཐ་དད་པ་དང་།
en: “Noble one, stay a moment and you will see a sight.”

source: གྲོང་རྡལ་ཐ་དད་པ་དང་། ཚོང་འདུས་ཐ་དད་པ་དང་། ལྗོངས་ཐ་དད་པ་དང་། འཁོར་གྱི་གྲོང་ཐ་དད་པ་དང་། ཁྱིམ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་རྒྱུད་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་རིས་ཐ་དད་པ་དང་། སེམས་ཅན་རྣམ་པ་མྱི་མཐུན་པ་ཐ་དད་པ་དང་། ལམ་གྱི་རྒྱུད་ཐ་དད་པ་དང་། གནས་ཀྱི་རྣམ་པ་དང་། མྱིང་དུ་བྱ་བ་ཐ་དད་པ་ནས། སེམས་ཅན་སྐྱེ་མཆེད་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: As soon as the householder Vidvān said those words, at that moment, having been invited by the householder Vidvān in the prayers he had made in the past, there came countless beings from different directions, from different lands, from different districts, from different towns, from different markets, from different cities, from different villages, from different hamlets, from different houses, from different castes, from different families, from different levels of families, from different ways of life, and from different classifications of stations in life.

source: ཁ་ཟས་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་ཁ་ཟས་སྣ་ཚོགས་འདོད་པ། བསམ་པ་ཐ་དད་པ་བཟའ་བ་དང་བཏུང་བ། གཙང་མ་འདོད་པ་དང་། ཤ་འདོད་པ་དང་། ཁ་ཟས་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དོན་དུ་གཉེར་བ། ལམ་གྱི་རྒྱུད་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཁྱད་པར་དུ་སྐྱེས་པའི་སྐྱེ་མཆེད་ལ་གནས་པ་འདི་ལྟ་སྟེ། མིའི་ནང་ནས་འབྲས་ཆན་དང་།
en: These beings had various different sensory perceptions, wishing for various kinds of food, desiring various kinds of food, with various aspirations, desiring different aspirations and desires, desiring pure food and drink, desiring meat, wishing to consume contrasting kinds of different food, and remaining in various kinds of distinct sensory perceptions and different ways of life.

source: སྲན་ཆན་དང་། ཁུར་བ་དང་། སྐྱོ་མ་དང་། ཉ་དང་། ཤ་ལ་སོགས་པ་ཁམ་གྱིས་བཟའ་བའི་ཁ་ཟས་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་དང་།
en: In other words, among humans there were those who wished for such various kinds of food as boiled rice, sour gruel, broths, fish, and meat.

source: མིའི་ནང་ནས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་ན་རྣམ་པར་སྤྱོད་པ་དག་ལས་ཀྱང་། ཁ་ཟས་དང་བཏུང་བ་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་ཐོགས་པ་མྱེད་པར་གཏོང་བའི་རྔའི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས་ཀུན་ཀྱང་འོངས་བར་གྱུར་ཏེ། འོངས་ནས་ཀྱང་ཁྱིམ་བདག་མཁས་པ་ལ་སློངས་མོ་འདེབས་སོ། །
en: Whatever were the different kinds of food and drink that were wished for by those with different ways of life among human beings, through the power of the bodhisattva, the drumbeat of the unimpeded generosity of the bodhisattva, and the invitation made by the past prayers of the bodhisattva, all those human beings came there, and when they had arrived they entreated the householder Vidvān.

source: གདོང་དུ་ལྟའོ། །
en: They looked upon him, observed him, and addressed him.

source: སྡོད་དེ། གསོལ་བ་འདེབས་སོ། དེ་ནས་ཁྱིམ་བདག་མཁས་པས་སློང་བ་དེ་དག་ཀུན་ནས་འདུས་པར་ཤེས་ནས། ཡུད་ཙམ་དུ་བསམས་ཏེ་ནམ་མཁའ་ལ་བལྟས་པ་དང་།
en: The householder Vidvān, knowing that the petitioners had all gathered there, thought for a moment and then looked up into the sky.

source: ནམ་མཁའི་དབྱིངས་ནས། ཁ་ཟས་དང་བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་རོ་སྣ་ཚོགས་དང་ལྡན་པ། ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ། དྲི་སྣ་ཚོགས་དང་ལྡན་པ་མང་པོ་འཐོན་ཏེ། ལག་མཐིལ་དུ་འོངས་པར་གྱུར་ཏོ། དེས་དེ་དག་ཡོངས་སུ་བླངས་ཤིང་དེ་ལྟར་ཀུན་ནས་འདུས་པའི་སློངས་མོ་བ་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: From the realm of the sky there came into the palms of his hands a great number of various kinds of food and drink, with various kinds of flavors, various kinds of colors, and various kinds of aromas.

source: དེ་དག་ཅི་འདོད་པའི་ཟས་དང་། བཏུང་བའི་རྣམ་པ་དང་། ཡོ་བྱད་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་སོ། །ཅི་འདོད་པ་ཡོངས་སུ་བྱིན་ནོ། །རབ་ཏུ་དགའ་བར་བྱས་སོ། ཤིན་ཏུ་ཚིམ་པར་བྱས་སོ། དགའ་བ་ཤིན་ཏུ་སྐྱེ་བར་བྱས་སོ། །
en: He gave these different kinds of food, drink, and utensils to all the petitioners gathered there, who had different aspirations and desires, in accordance with what they desired, so that they were satiated, pleased, contented, delighted, joyful, and overwhelmed with happiness.

source: ཉམས་ཤིན་ཏུ་བདེ་བར་བྱས་སོ། །ཡིད་རབ་ཏུ་དགའ་བར་བྱས་སོ། །དེ་ལྟར་དེ་དག་ཤིན་ཏུ་ཚིམ་པར་བྱས་ནས། དེས་ཀྱང་མ་ཆོག་སྟེ། དེའི་འོག་ཏུ་ཆོས་བསྟན་པ་འདི་ལྟ་སྟེ།
en: Having concluded satisfying them in that way, afterward he taught them the Dharma.

source: ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་དེ་ཆོས་བསྟན་ཏོ། །ཕོངས་པ་ཐམས་ཅད་འབྱུང་བ་མི་སྲིད་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། སྐྱིད་པ་ཆེན་པོ་ཡོངས་སུ་འགྲུབ་པར་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚུལ་འཐོབ་བ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། དགའ་བ་བཟའ་བའི་ཟས་རབ་ཏུ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཤིན་ཏུ་བརྒྱན་པའི་ལུས་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། ཐུབ་པ་མྱེད་པའི་སྟོབས་རྣམ་པར་དག་པར་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བླ་ན་མྱེད་པའི་ཁ་ཟས་ཡོངས་སུ་ཤེས་པ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བདུད་ཀྱི་དཔུང་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་བསོད་ནམས་ཀྱི་སྟོབས་མྱི་ཟད་པ་རབ་ཏུ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་བྱས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: He taught the Dharma that elucidated the cause of gathering a vast accumulation of wisdom, elucidated the cause that made it impossible for poverty to occur, elucidated the cause of the arising of perfect great enjoyment, elucidated the cause of the arising of the attainment of the Dharma’s way of wisdom, elucidated the cause of the arising of gathering a vast accumulation of merit, elucidated the cause of the arising of the attainment of the enjoyment of the food of happiness, elucidated the cause of the arising of the attainment of a body adorned by the signs and features of a great being, elucidated the cause of the arising of the attainment of invincible strength, elucidated the cause of the arising of the attainment of the unsurpassable food of wisdom, and elucidated the cause of the arising of the attainment of the inexhaustible strength of merit that defeats the strength of all the māras.

source: དེས་ཁ་ཟས་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་ནམ་མཁའི་དབྱིངས་ནས་ཁ་ཟས་རྣམ་པ་སྣ་ཚོགས་བླངས་ཤིང་ཚིམ་པར་བྱས་ཏེ། དེ་དག་ལ་ཚེ་དང་། མདོག་དང་། སྟོབས་དང་། བདེ་བ་དང་།
en: When all those who came wishing for food were satisfied through having obtained various kinds of food from the realm of the sky, the householder Vidvān taught them the Dharma so that they could attain perfect lifespans, color, strength, happiness, and eloquence.

source: སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ། འཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ། །དེས་བཏུང་བ་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་བཏུང་བ་མང་པོ་ཞིམ་པ་ཁ་ན་མ་ཐོ་བ་མེད་པ། ཡིད་ཤིན་ཏུ་དགའ་བར་བྱེད་པ་དག་གིས་ཚིམ་པར་བྱས་ནས། དེ་དག་ལ་འཁོར་བས་སྐོམ་ཞིང་འཁོར་བ་ལ་དགའ་བ་ལས་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ལ་དགའ་ཞིང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་མོས་པ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་ཆོས་བསྟན་ཏོ། དེས་རོའི་མཆོག་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་རོའི་མཆོག་སྣ་ཚོགས་དང་རབ་དང་། སྐྱུར་བ་དང་།
en: When all those who came wishing for drink were satisfied and delighted through having obtained many kinds of delicious, nontransgressive drinks, the householder Vidvān taught them the Dharma so that they would turn away from thirsting for saṃsāra, from delighting in saṃsāra, and would develop a delight in the Buddhadharma, a thirst for the Buddhadharma.

source: ལན་ཚ་དང་། ཚ་བ་དང་། ཁ་བ་དང་། །བསྐ་བ་རྣམ་པ་ཐ་དད་པས་ཡོངས་སུ་ཚིམ་པར་བྱས་ཏེ། དེའི་འོག་ཏུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རོ་བྲོ་བའི་མཆོག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ། །
en: After all those who came wishing for excellent flavors had been satisfied by the different excellent flavors of sweetness, sourness, saltiness, spiciness, bitterness, and astringency, the householder Vidvān taught them the Dharma so that they would attain the supreme flavor of the physical signs of a great being.

source: དེས་བཞོན་པ་དོན་དུ་གཉེར་ཅིང་ཕྱོགས་ཀྱི་རྒྱུད་སྣ་ཚོགས་ནས་འོངས་པ་རྣམས་ལ་བཞོན་པ་སྣ་ཚོགས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བསྡུད་དེ། དེ་དག་ཐེག་པ་ཆེན་པོ་ལ་གནས་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ། །
en: When all those who had come from all directions wishing for carriages had received the gifts of different kinds of carriages, the householder Vidvān taught them the Dharma so that they would ride upon the Mahāyāna.

source: དེས་གོས་དོན་དུ་གཉེར་ཅིང་ཕྱོགས་སྣ་ཚོགས་ནས་འོངས་པ་ཀུན་ནས་འདུས་པར་ཤེས་ནས། ཡུད་ཙམ་དུ་བསམས་ཏེ། ནམ་མཁའི་དབྱིངས་ལ་བལྟས་པ་དང་།
en: When those wishing for clothes had come from all directions, the householder Vidvān, knowing that they had all gathered there, thought for a moment and then looked up into the sky.

source: ནམ་མཁའི་དབྱིངས་ལས་གོས་སྣ་ཚོགས་དང་། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་ཏུ་འདུག་པ་ཁ་དོག་སྣ་ཚོགས་ཅན་ཁ་དོག་དུ་མར་རྣམ་པར་དག་པ་དག་འཐོན་ཅིང་ལག་པའི་མཐིལ་དུ་འོངས་པས།
en: From the realm of the sky appeared many kinds of pure clothes in various colors—blue, yellow, red, white, madder, and transparent—that came into the palms of his hands.

source: དེས་དེ་དག་གིས་སློངས་མོ་བ་དེ་དག་ལ་ཡོངས་སུ་བསྡུད་ནས། དེ་བཞིན་གཤེགས་པའི་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་བླ་ན་མྱེད་པ་དང་། མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཐོབ་པར་འགྱུར་བ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ། །དེ་བཞིན་དུ་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་ཇི་ལྟར་འོངས་པའི་སློངས་མོ་བ་རྣམས་ལ་སྡུད་པ་བྱས་ནས།
en: When the householder Vidvān had distributed these to the petitioners, he taught them the Dharma so that they would have the pure attainment of a tathāgata’s unsurpassable sense of shame and conscience that is like the color of gold.

source: ཅི་རིགས་སུ་ཆོས་བསྟན་ཏོ། །དེ་ལྟར་ཁྱིམ་བདག་མཁས་པས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་བསྟན་པ་བྱས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: In that way, the householder Vidvān demonstrated the inconceivable scope of the bodhisattva liberation.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཡིད་ཀྱི་མཛོད་ནས་བྱུང་བའི་བསོད་ནམས་ཀྱི་རྣམ་པར་ཐར་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོ་བྱད་ལ་དབང་ཐོབ་པ་རིན་པོ་ཆེའི་ལག་པ་ཐོབ་པར་གྱུར་པ། འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་ལག་པས་ཡོངས་སུ་ཁེབས་པར་བྱས་ཤིང་།
en: Then he said to Sudhana, the head merchant’s son, “I know only the bodhisattva liberation called the merit that arises from the treasury of the mind.

source: སངས་རྒྱས་ཀྱི་མཆོད་པ་སྣ་ཚོགས་བསྒྲུབ་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་རིན་པོ་ཆེ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པ་དེ་བཞིན་དུ་རྒྱན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཅོད་པན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཁང་པ་བརྩེགས་པ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ན་བཟའ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བ་དང་། གླུ་ཡིད་དུ་འོང་བའི་དབྱངས་སྙན་པ་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། སྤོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་ཆོས་གོས་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་ཁ་དོག་སྣ་ཚོགས་དང་། རྣམ་པ་ཐམས་ཅད་དུ་སངས་རྒྱས་ཐམས་ཅད་མཆོད་པའི་སྤྲིན་གྱི་ཆར་དང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་སངས་རྒྱས་ཐམས་ཅད་མཆོད་ཅིང་བསྙེན་བཀུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བའི་ཕྱིར་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་འབེབས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པ་འམ།
en: How could I know the conduct, describe the qualities, or teach the miraculous powers of the bodhisattvas who have attained the power over requisites; who have attained jewel-producing hands; who can cover all world realms without exception with their hands in order to accomplish various offerings to the buddhas; who can send down rain from clouds of jewels of various colors upon the circles of the followers of all the tathāgatas; and similarly can send down rain from clouds of jewelry of various colors, from clouds of crowns of various colors, from clouds of kūṭāgāras of various colors, from clouds of clothing of various colors, from clouds of the various melodious sounds of divine musical instruments being played and beaten and beautiful songs, from clouds of flowers of various colors, from clouds of perfumes of various colors, from clouds of incense, garlands, ointments, powders, Dharma robes, parasols, banners, and flags of various colors, from clouds of every kind of offering to all the buddhas, and from clouds of all requisites that fall upon all the circles of followers of the tathāgatas and all realms of beings in order to honor and make offerings to all the buddhas and in order to ripen and guide all beings?

source: ཡོན་ཏན་བརྗོད་པའམ། རྣམ་པར་འཕྲུལ་བ་བསྟན་པ་ནུས་རེ་སྐན། །
en: “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སེང་གེའི་གཟུགས་ཤེས་བྱ་བ་ཡོད་དེ། དེ་ན་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཅེས་བྱ་བ་འདུག་གིས།
en: In this southern region there is a town called Siṃhapota, where dwells a head-merchant patron of the Dharma by the name of Ratnacūḍa.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཁྱིམ་བདག་མཁས་པ་ལ་ཆོས་ཀྱི་རིམ་གྲོས་སློབ་མའི་ཚུལ་བསྟན་ཏེ། དེའི་བྱིན་གྱི་རླབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་འགྱུར་བར་ཡོངས་སུ་བལྟ་ཞིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དེ་ལ་རང་ལུས་པར་བལྟ་བ་དང་།
en: Sudhana, the head merchant’s son, was pleased, delighted, enraptured, overjoyed, and filled with happiness.

source: དགེ་བའི་བཤེས་གཉེན་དབེན་པར་སེམས་པ་རྒྱུན་མྱི་འཆད་པར་བསྟན་པ་དང་།
en: He demonstrated to the householder Vidvān the respect of a Dharma pupil.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་བཀའ་ཤིན་ཏུ་ཉན་པའི་སེམས་དང་ལྡན་པར་བསྟན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་དབང་དུ་འགྱུར་བའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དང་། ཚིག་མཉན་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའི་དད་པའི་དབང་པོ་ལ་བསམ་པ་བྱེད་ཅིང་།
en: Sudhana viewed him as someone through whose blessing one can receive all the Buddhadharma, viewed him as someone through reliance on whom one can attain omniscience; he demonstrated a continuous delight in the kalyāṇamitras; he had the determination to obey every instruction of the kalyāṇamitras; being under their power he followed the kalyāṇamitras; he longed to listen to the teachings and words of the kalyāṇamitras; he kept in mind the power of faith that came from the kalyāṇamitras; he sought the instructions of the kalyāṇamitras; and he aspired to follow and please the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་བཏམ་སྟེ་བཏང་བས། དགེ་བའི་བཤེས་གཉེན་བསྙེན་ཅིག་བཀུར་བ་དང་། །རྗེས་སུ་འབྲང་བར་བྱ་བའི་སེམས་ཀྱིས། ཁྱིམ་བདག་མཁས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཁྱིམ་བདག་མཁས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Sudhana bowed his head to the feet of the householder Vidvān, circumambulated the householder Vidvān, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the householder Vidvān.

source: ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱིམ་བདག་མཁས་པའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བསོད་ནམས་ཀྱི་ཆུ་བོ་དེ་ལ་ནི་ཡིད་ཆེས་པར་སེམས།
en: Ratnacūḍa Chapter 18 Sudhana, the head merchant’s son, had conviction in that river of merit.

source: བསོད་ནམས་ཀྱི་ཞིང་དེ་ལ་ནི་ཡང་དག་པར་བལྟ།
en: He viewed that field of merit.

source: བསོད་ནམས་ཀྱི་རི་བོ་དེ་ནི་ཡོངས་སུ་སྦྱོང་།
en: He purified that mountain of merit.

source: བསོད་ནམས་ཀྱི་མུ་སྟེགས་དེ་ལ་ནི་ཡང་དག་པར་འཛེག །
en: He climbed down that stairway to the bathing place of merit.

source: བསོད་ནམས་ཀྱི་མཛོད་དེ་ནི་རྣམ་པར་འབྱེད།
en: He opened that treasury of merit.

source: བསོད་ནམས་གྱི་གཏེར་དེ་ལ་ནི་ཤིན་ཏུ་ལྟ།
en: He viewed that treasure of merit.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་ཡང་དག་པར་ལེན།
en: He carried away that heap of merit.

source: བསོད་ནམས་ཀྱི་སྟོབས་དེ་ནི་ཡོངས་སུ་བསྐྱེད།
en: He developed that strength of merit.

source: བསོད་ནམས་ཀྱི་ཤུགས་དེ་ནི་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་།
en: He increased that power of merit.

source: མཐར་གྱིས་གྲོང་ཁྱེར་སེང་གེའི་གཟུགས་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana eventually arrived at the town of Siṃhapota.

source: ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: He searched for Ratnacūḍa, the head-merchant patron of the Dharma.

source: ཚོང་འདུས་ཀྱི་སྲང་ཞིག་ན་འདུག་པ་མཐོང་ནས།
en: He saw him in the middle of a market.

source: དེས་དེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Sudhana bowed his head to Ratnacūḍa’s feet, circumambulated Ratnacūḍa, keeping him to his right, many hundreds of thousands of times, and sat down before him.

source: མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: With his hands together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ན། འཕགས་པ་ལམ་གང་གིས་བདག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་མ་ན་ངག་ལེགས་པར་མྱི་སྩལ་ཏམ།
en: “Ārya, will you not bestow on me the instruction for the bodhisattva path, which is the path by which I will become omniscient?”

source: དེ་ནས་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ལག་པ་ནས་བཟུང་སྟེ། རང་གི་ཁྱིམ་གང་ན་བ་དེར་ཁྲིད་དེ་ཁྱིམ་དེ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོའི་ཁྱིམ་ལ་ལྟོས་ཤིག་ཅེས་ནས།
en: Ratnacūḍa, the head-merchant patron of the Dharma, grasped the hands of Sudhana, the head merchant’s son, led him to his home and, showing Sudhana his home, said, “Noble one, look at my home!”

source: དེས་བལྟས་ན་ཁྱིམ་དེ་དག་ཅིང་འོད་གསལ་བ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བྱས་པ་སྟེ།
en: Sudhana looked at it. The house was made of pure, bright Jambu River gold.

source: ཡངས་ཤིང་མཐོ་ལ་དངུལ་གྱི་ར་བས་བསྐོར་བ།
en: It was vast and tall and encircled by a wall of silver.

source: ཤེལ་གྱི་རྩིག་པས་ཤིན་ཏུ་ལེགས་པར་བརྩིགས་ཏེ། མཛེས་པར་བྱས་བ།
en: It was beautified by arrangements of bright crystals.

source: བཻ་ཌཱུརྱའི་ཕུང་པོ་བརྒྱ་ཕྲག་སྟོང་གིས་རབ་ཏུ་བརྒྱན་པ།
en: It was adorned by a hundred thousand clusters of beryls.

source: མུས་རག་ལ་པའི་ཀ་བ་བཀྱེ་བ།
en: There was an array of pillars of white coral.

source: མུ་ཏིག་དམར་པོ་ལས་བྱས་པའི་སེང་གེའི་ཁྲི་ཤིན་ཏུ་བཤམས་པ།
en: A lion throne made of red pearls had been erected.

source: ནོར་བུ་རིན་པོ་ཆེ་རང་བཞིན་སྣང་བའི་སེང་གེའི་རྒྱལ་མཚན་བསྒྲེང་བ།
en: Lion banners made of asteria jewels were displayed.

source: ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་བླ་རེ་བྲེས་པ།
en: Overhead there was a shining canopy of jewels.

source: གསེར་གྱི་དྲ་བ་ཡིད་བཞིན་གྱི་ནོར་བུས་བརྒྱན་པས་ཀུན་ནས་ཡོག་པ།
en: It was draped in nets of gold adorned with wish-fulfilling jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་གྲངས་མྱེད་པས་རབ་ཏུ་བརྒྱན་པ།
en: There was an array of countless varieties of precious jewels.

source: ཨ་སྨ་གར་བྷ་ལས་བརྩིགས་པའི་རྫིང་བུ་ཆུ་བསིལ་བས་གང་བ་དང་ལྡན་པ།
en: It was furnished with ponds made of emerald and filled with cool water.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གིས་བསྐོར་བ།
en: It was encircled by trees made of precious materials.

source: རྒྱ་ཆེ་ཞིང་ཡངས་པ་རིམ་པ་བཅུར་བརྩེགས་པ།
en: It was massive. It was vast. It had ten stories.

source: ཤིན་ཏུ་མཐོ་བ།
en: It was very tall.

source: སྒོ་བརྒྱད་དང་ལྡན་པར་འདུག་པ་མཐོང་ནས།
en: It had eight doors.

source: དེས་ཁྱིམ་དེའི་ནང་དུ་ཕྱིན་ཏེ།
en: Sudhana went inside and looked around.

source: ཀུན་ཏུ་བལྟས་ན་རིམ་ཁང་ཐ་མའི་ནང་ན་བཟའ་བ་དང་བཏུང་བའི་རྣམ་པ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the first floor he saw food and drink being distributed.

source: རིམ་ཁང་གཉིས་པའི་ནང་ན་གོས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་། །
en: On the second floor he saw clothing being given away.

source: རིམ་ཁང་གསུམ་པའི་ནང་ན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the third floor he saw jewelry and adornments being given away.

source: རིམ་ཁང་བཞི་པའི་ནང་ན་བཙུན་མོའི་འཁོར་དགའ་བའི་ཡོ་བྱད་དུ་བྱ་བ་བུད་མེད་རིན་པོ་ཆེས་ཆེན་པོའི་སྟེང་ན་གཟུང་དུ་བྱ་བ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་། །
en: On the fourth floor he saw being given away the most precious, excellent maidens on the great earth who are the pleasures enjoyed in harems.
